Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: This is the default implementation of the not-equal-to operator (!=) for any type that conforms to Equatable.
ja: Equatableに準拠するあらゆる型に対して、不等演算子（!=）の初期状態の実装です。

source: This is the same as the number of bytes moved when an UnsafePointer<T> instance is incremented.
ja: これは、UnsafePointer<T>が増大させられる時に動かされるバイト数と同じです。

source: This latter behavior is a contrast with Just, which always publishes a single value.
ja: この後者の挙動は、Justと対照的です。それは常にある単一の値を出版します。

source: This list describes how Swift imports types with different nullability annotations:
ja: このリストは、どのようにSwiftが異なるヌル可能性注釈で型をインポートするかを記述します：

source: This method ensures that the set has unique, mutable, contiguous storage, with space allocated for at least the requested number of elements.
ja: このメソッドは、集合が、少なくとも要請された数の要素に割り当てられた空間とともに、固有な、可変の、隣接するストレージを持つことを保証します。

source: This method has the effect of removing the specified range of elements from the collection and inserting the new elements at the same location.
ja: このメソッドは、指定された範囲の要素をコレクションから取り除き、そして新しい要素を同じ場所に挿入する効果を持ちます。

source: This method implements the mathematical notion of lexicographical ordering, which has no connection to Unicode.
ja: このメソッドは、語彙筆記的順序の数学的概念を実装します、それはユニコードに関係はありません。

source: This method is available when the sequence’s iterator element type is the tuple type (CGRect, NSColor).
ja: このメソッドが利用可能なのは、シーケンスのもつイテレータ要素型がタプル型(CGRect, NSColor)である時です。

source: This method is available when the sequence’s iterator element type is the tuple type (CGRect, gray: CGFloat).
ja: このメソッドが利用可能なのは、シーケンスのもつイテレータ要素型がタプル型(CGRect, gray: CGFloat)である時です。

source: This method is available when the sequence’s iterator element type is NSRect.
ja: このメソッドが利用可能なのは、シーケンスのもつイテレータ要素型が NSRectである時です。

source: This method is equivalent to calling random(in:using:), passing in the system’s default random generator.
ja: このメソッドは、random(in:using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling randomElement(using:), passing in the system’s default random generator.
ja: このメソッドは、randomElement(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling shuffle(using:), passing in the system’s default random generator.
ja: このメソッドは、shuffle(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling shuffled(using:), passing in the system’s default random generator.
ja: このメソッドは、shuffled(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling the version that takes a generator, passing in the system’s default random generator.
ja: このメソッドは、ある生成子をとるバージョンを、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is implemented as a & (bitwise AND) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する&（ビット単位AND）演算として実装されます。

source: This method is implemented as a ^ (bitwise XOR) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する^（ビット単位XOR）演算として実装されます。

source: This method is implemented as a | (bitwise OR) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する|（ビット単位OR）演算として実装されます。

source: This method is preferred over reduce(_:_:) for efficiency when the result is a copy-on-write type, for example an Array or a Dictionary.
ja: このメソッドは、効率のためにreduce(_:_:)より好まれます、その結果がコピーオンライト型である場合、例えばArrayまたは辞書に対しては。

source: This method returns nil if the container does not have a value associated with key, or if the value is null.
ja: このメソッドは、nilを、そのコンテナがkeyと関連付けられる値を持たないならば、またはその値がnullならば、返します。

source: This operation requires that the current NSGraphicsContext is non-nil.
ja: この演算は、現在のNSGraphicsContextが非nilであることが必須です。

source: This permanently modifies the graphics state, so save the current state beforehand and restore it afterwards.
ja: これは、永続的にグラフィックス状態を修正します、なので現在の状態をあらかじめ保存して、後でそれを復元してください。

source: This pointer is valid only for the duration of the call to body.
ja: このポインタは、ただbodyへの呼び出しの間にのみ有効とされます。

source: This property is always true for signed integer types.
ja: このプロパティは、符号付き整数型に対して常にtrueです。

source: This property must always evaluate to the same executor for a given actor instance, and holding on to the actor must keep the executor alive.
ja: このプロパティは、与えられたアクターインスタンスに対して常に同じエグゼキュータに評価されなければなりません、そしてアクターを手放さないことはエグゼキュータを存続させる必要があります。

source: This property trades safety for performance.
ja: このプロパティは性能と安全を交換します。

source: This property will be implicitly accessed when work needs to be scheduled onto this actor.
ja: このプロパティは、仕事がこのアクター上に予定を組まれる必要がある時に、暗黙的にアクセスされます。

source: This publisher produces the type wrapped by the optional.
ja: このパブリッシャーは、オプショナルによってラップされた型を生み出します。

source: This setting has no effect on mirrors reflecting value type instances.
ja: この設定は、値型インスタンスをリフレクションするミラー上では効果を持ちません。

source: This should report all keys present which are convertible to the requested type.
ja: これは、要請された型に変換可能である、存在する全てのキーを報告するべきです。

source: This type is the result of x.reversed() where x is a collection having bidirectional indices.
ja: この型は、x.reversed()の結果です、ここでxは双方向性のインデックスを持つコレクションです。

source: This type may differ from the subject’s dynamic type when this mirror is the superclassMirror of another mirror.
ja: この型は、このミラーが別のミラーのsuperclassMirrorである時は、この主題のもつ動的型と異なるかもしれません。

source: This unique identifier is only valid for comparisons during the lifetime of the instance.
ja: この固有識別子は、インスタンスのライフタイムの間での比較に対してだけ有効です。

source: This value is always positive.
ja: この結果は常に正です。

source: This value may be nontrivial to compute; it is usually a good idea to store this information in the “header” area when an instance is created.
ja: この値を計算するのは、些細なことではありません；通常良い考えであるのは、この情報をインスタンスが作成されるときに「ヘッダ」領域に格納することです。

source: Those annotations change how Swift imports your declarations.
ja: それら注釈は、どのようにSwiftがあなたの宣言をインポートするかを変更します。

source: To access a slice of a collection using a range expression, use the collection’s generic subscript that uses a range expression as its parameter.
ja: 範囲式を使ってコレクションのスライスにアクセスするには、そのコレクションの持つ総称体添え字で、範囲式をそれのパラメータとして使うものを使用してください。

source: To add Numeric protocol conformance to your own custom type, implement the required initializer and operators, and provide a magnitude property using a type that can represent the magnitude of any value of your custom type.
ja: Numericプロトコル準拠をあなた独自のカスタム型に加えるには、必須イニシャライザおよび演算子を実装してください、そしてあなたのあつらえの型のあらゆる値の規模を表現できる型を使ってmagnitudeプロパティを提供してください。

source: To add RangeReplaceableCollection conformance to your custom collection, add an empty initializer and the replaceSubrange(_:with:) method to your custom type.
ja: RangeReplaceableCollection準拠をあなたのあつらえのコレクションに加えるには、ひとつの空のイニシャライザおよびreplaceSubrange(_:with:)メソッドをあなたのあつらえの型に加えてください。

source: To add Sequence conformance to your own custom type, add a makeIterator() method that returns an iterator.
ja: Sequence準拠をあなた独自のあつらえの型に加えるには、あるイテレータを返すmakeIterator()メソッドを加えてください。

source: To add a new lazy sequence operation, extend this protocol with a method that returns a lazy wrapper that itself conforms to LazySequenceProtocol.
ja: 新しい遅延シーケンス演算を加えるには、このプロトコルをあるメソッドで拡張してください、それはそれ自身LazySequenceProtocolに準拠するある遅延ラッパーを返すものです。

source: To add conformance to the MutableCollection protocol to your own custom collection, upgrade your type’s subscript to support both read and write access.
ja: MutableCollectionプロトコルへの準拠をあなた独自のあつらえのコレクションに加えるには、あなたの型のもつ添え字を更新して読み書きアクセス両方をサポートするようにしてください。

source: To add new lazy collection operations, extend this protocol with methods that return lazy wrappers that are themselves LazyCollectionProtocols.
ja: 新しい遅延コレクション操作を加えるために、このプロトコルを、それら自身がLazyCollectionProtocolである遅延ラッパーを返すメソッドで拡張してください。

source: To add values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を加算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To avoid dropping the customization provided by ancestor classes, an override of customMirror should pass .customized({ super.customMirror }) as ancestorRepresentation when initializing its mirror.
ja: 先祖クラスのカスタマイズを失くすのを防ぐために、customMirrorのオーバーライドは.customized({ super.customMirror })をancestorRepresentationとしてそれのミラーを初期化する時に渡さなければなりません。

source: To avoid the unexpected copy, use the index(after:) method starting with startIndex to produce indices instead.
ja: 予期されないコピーを避けるために、代わりにindex(after:)メソッドを使ってstartIndexで始めることで、インデックスを生成してください。

source: To check whether a collection is empty, use its isEmpty property instead of comparing count to zero.
ja: あるコレクションが空かどうか調べるには、それのisEmptyプロパティを使ってください、countをゼロと比較するのでなく。

source: To check whether the collection is empty, use its isEmpty property instead of comparing count to zero.
ja: コレクションが空かどうか調べるには、それのisEmptyプロパティを使ってください、countをゼロと比較するのでなく。

source: To conditionally bind the wrapped value of an Optional instance to a new variable, use one of the optional binding control structures, including if let, guard let, and switch.
ja: Optionalインスタンスのラップされた値を新しい変数へ条件付きの束縛を行うには、if let、guard let、そしてswitchを含む、オプショナル束縛制御構造の１つを使ってください。

source: To conform to Hashable, implement the hash(into:) requirement instead.
ja: Hashableに準拠するには、hash(into:)要件を代わりに実装してください。

source: To create an empty instance, assign an empty array literal to your variable.
ja: 空のインスタンスを作成するには、空の配列リテラルをあなたの変数に割り当ててください。

source: To customize the logging of your type in a playground, conform to the CustomPlaygroundDisplayConvertible protocol, which does not use the PlaygroundQuickLook enum.
ja: あなたの型のログ取りをプレイグラウンドにおいてカスタマイズするには、CustomPlaygroundDisplayConvertibleプロトコルに準拠してください、それはPlaygroundQuickLook enumを使いません。

source: To customize the mirror representation of a custom type, add conformance to the CustomReflectable protocol.
ja: あつらえの型のミラー表現をカスタマイズするには、CustomReflectableプロトコルへの準拠を加えてください。

source: To customize your type’s implementation, provide your own mutating negate() method.
ja: あなたの型のもつ実装をカスタマイズするには、あなた自身の変更negate()メソッドを提供してください。

source: To establish that a type you’ve created supports nondestructive iteration, add conformance to the Collection protocol.
ja: あなたが作成した型が非破壊反復をサポートすることを確立するには、Collectionプロトコルに対する準拠を加えてください。

source: To find the position that corresponds with this index in the original, underlying collection, use that collection’s index(before:) method with the base property.
ja: オリジナル、基盤コレクションでのこのインデックスに相当する位置を見つけるには、そのコレクションのindex(before:)メソッドをbaseプロパティとともに使ってください。

source: To inherit all the default implementations from the OptionSet protocol, the Element type must be Self, the default.
ja: OptionSetプロトコル由来のすべての省略時実装を継承するには、Element型はSelf、初期状態、でなければなりません。

source: To iterate over the elements of a collection with its indices, use the zip(_:_:) function.
ja: あるコレクションの要素すべてにわたってそれのインデックスで反復するには、zip(_:_:)関数を使ってください。

source: To make a Swift class available in Objective-C, make it a descendant of an Objective-C class.
ja: SwiftクラスをObjective-Cで利用可能にするには、それをObjective-Cクラスの子孫にしてください。

source: To make a custom type conform to the RandomNumberGenerator protocol, implement the required next() method.
ja: あなたのあつらえのクラスをRandomNumberGeneratorプロトコルに準拠させるには、必須next()メソッドを実装してください。

source: To make an Objective-C declaration unavailable at compile time in both Swift and Objective-C, use the NS_UNAVAILABLE macro.
ja: あるObjective-C宣言をSwiftとObjective-Cの両方で利用できなくするには、NS_UNAVAILABLEマクロを使ってください。

source: To make your Swift class accessible and usable back in Objective-C, make it a descendant of an Objective-C class.
ja: あなたのSwiftクラスを逆にObjective-Cにおいてアクセス可能および利用可能にするには、それをObjective-Cクラスの子孫にしてください。

source: To multiply values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を乗算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To prevent a declaration in an Objective-C API from being imported, pass a single parameter to the NS_SWIFT_UNAVAILABLE macro.
ja: Objective-C APIの中のある宣言がインポートされるのを防ぐには、ある単一のパラメータをNS_SWIFT_UNAVAILABLEマクロに渡してください。

source: To prevent bypassing customized ancestors, pass .customized({ super.customMirror }) as the ancestorRepresentation parameter when implementing your type’s customMirror property.
ja: あつらえの先祖を迂回することを防ぐには、.customized({ super.customMirror })をancestorRepresentationパラメータとして、あなたの型のもつcustomMirrorプロパティを実装する時に渡してください。

source: To remove the last element of a collection that might be empty, use the popLast() method instead.
ja: 空であるかもしれないあるコレクションの最後の要素を削除するには、popLast()関数を使ってください。

source: To restore efficient set operations, create a new set from the result.
ja: 能率的な集合演算を取り戻すには、新しい集合を結果から作成してください。

source: To safely access the properties and methods of a wrapped instance, use the postfix optional chaining operator (postfix ?).
ja: ラップされたインスタンスの持つプロパティおよびメソッドに安全にアクセスするには、後置オプショナル連鎖演算子（後置?）を使ってください。

source: To sort the elements of your collection in descending order, pass the greater-than operator (>) to the sort(by:) method.
ja: あなたのコレクションの要素を降順にソートするには、より大きい演算子（>）をsort(by:)メソッドに渡してください。

source: To sort the elements of your sequence in descending order, pass the greater-than operator (>) to the sorted(by:) method.
ja: あなたのシーケンスの要素を降順にソートするには、より大きい演算子（>）をsorted(by:)メソッドに渡してください。

source: To sort your sequence in descending order, pass the greater-than operator (>) as the areInIncreasingOrder parameter.
ja: あなたのシーケンスを降順にソートするには、より大きい演算子（>）をareInIncreasingOrderパラメータとして渡してください。

source: To specify a particular name for the class to use in Objective-C, mark it with @objc(name), where name is the name that your Objective-C code uses to reference the Swift class.
ja: 特定の名前をクラスに対して指定してObjective-Cで使うには、それを@objc(name)で印してください、ここでnameはあなたのObjective-CコードがSwiftクラスを参照するのに使う名前です。

source: To subtract values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を減算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To write each line to the file, pass a closure to the forEach(_:) method:
ja: 各行をファイルに書き出すには、クロージャをforEach(_:)メソッドに渡してください：

source: Topics
ja: 話題

source: Transforming a Range's Elements
ja: ある範囲の持つ要素を変換する

source: Transforming a Result
ja: 結果を変換する

source: Transforming a Sequence
ja: シーケンスを変形する

source: Transforming a Set
ja: 集合を変形する

source: Transforming an Optional Value
ja: オプショナル値の変換

source: Troubleshooting Tips and Reminders
ja: 問題解決の秘訣と注意

source: Two edge cases are worth particular attention:
ja: ２つの境界事例は特別な注意を払う価値があります：

source: Two elements are incomparable if neither is ordered before the other according to the predicate.
ja: ２つの要素は、述部によるとどちらもが他の前に並べられるならば比較できない。

source: Two ranges are equal when they have the same lower and upper bounds.
ja: ２つの範囲は、それらが同じ下方および上方境界を持つとき等しいです。

source: Type Aliases
ja: 型エイリアス

source: Type Method
ja: 型メソッド

source: Type Methods
ja: 型メソッド

source: Type Properties
ja: 型プロパティ

source: Type Property
ja: 型プロパティ

source: Types that conform to RandomNumberGenerator should specifically document the thread safety and quality of the generator.
ja: RandomNumberGeneratorに準拠する型は、とりわけ生成子のスレッド安全と品質を文書化すべきです。

source: Typical usage stores a count and capacity in Header and destroys any live elements in the deinit of a subclass.
ja: 典型的なやり方は、総数と容量をHeaderに格納して、サブクラスのdeinitの中のあらゆる生きている要素を破壊します。

source: Typically, you use do-catch statements to handle throwing expressions immediately, but sometimes you need to store the whole result of the operation for later processing during tasks like analyzing a batch of calls.
ja: 概して、あなたはdo-catch文を使うことでスロー式を直接に取り扱います、しかし時にはあなたは演算の結果全体を保管しておく必要があります、もっと後で、一群の呼び出しを分析することのような作業の間に処理するために。

source: Unannotated declarations within the audited region are treated as nonnullable.
ja: 監査された領域内部の注釈を付けられない宣言は、非ヌル可能性として取り扱われます。

source: Unconditional Unwrapping
ja: 無条件にアンラップする

source: Unconditionally prints a given message and stops execution.
ja: 無条件に与えられたメッセージを出力して実行を停止します。

source: Unconditionally unwrapping a nil instance with ! triggers a runtime error.
ja: nilインスタンスを!で無条件にアンラップすることは、実行時エラーの引き金となります。

source: Under typical system conditions, it's usually printed last, but you shouldn't write code that relies on the order of an asychronous call relative to synchronous code without performing more careful synchronization between threads.
ja: 典型的なシステム条件の下、それはふつうは最後に印字されます、しかしあなたは、スレッド間でより注意深い同期を実行することなく、同期コードに関連して非同期呼び出しの順番を頼るコードを書くべきではありません。

source: Understand how different API calls to your closures can affect your app.
ja: あなたのクロージャに対する異なるAPI呼び出しがどのようにあなたのアプリに影響を与えられるかを理解します。

source: Understand the Results of Synchronous and Asynchronous Calls
ja: 同期および非同期呼び出しの結果を理解する

source: Unless the collection conforms to the BidirectionalCollection protocol, start must be less than or equal to end.
ja: コレクションがBidirectionalCollectionプロトコルに準拠しない場合は、startはendより少ないか等しくなければなりません。

source: Unless the collection guarantees random-access performance, calculating count can be an O(n) operation.
ja: そのコレクションが無作為アクセス性能を保証しない限り、countの算出は、O(n)演算であるはずです。

source: Unless you’re implementing a scheduler, you don’t generally interact with partial tasks directly.
ja: あなたがあるスケジューラを実装しているのでない限り、あなたは一般的に部分的タスクそれらと直接に相互作用しません。

source: Unlike enumerations, option sets provide a nonfailable init(rawValue:) initializer to convert from a raw value, because option sets don’t have an enumerated list of all possible cases.
ja: 列挙と異なり、オプションセットは生の値から変換するために失敗できないinit(rawValue:)イニシャライザを提供します、なぜならオプションセットは可能な場合全てを列挙したリストを持たないからです。

source: Unlike key-value pairs in a true dictionary, neither the key nor the value of a KeyValuePairs instance must conform to the Hashable protocol.
ja: 本当の辞書におけるキー値ペアとは違い、KeyValuePairsインスタンスのキーも値もHashableプロトコルに準拠する必要はありません。

source: Unlike ordinary set types, the Element type of an OptionSet is identical to the OptionSet type itself.
ja: 普通の集合型とは違い、あるOptionSetのElement型は、OptionSet型自体と全く同じです。

source: Unlike traditional truncating multiplication, the multipliedFullWidth(by:) method returns a tuple containing both the high and low parts of the product of this value and other.
ja: 従来的な切り詰め乗算と違って、multipliedFullWidth(by:)メソッドは、この値とotherの積のhighおよびlow部分の両方を含んでいるタプルを返します。

source: Update import statements in your Objective-C code (to #import "ProductModuleName-Swift.h") to refer to your new Swift code.
ja: あなたのObjective-Cコードにおいてインポート文を更新して（#import "ProductModuleName-Swift.h"へと）、あなたの新しいSwiftコードを参照するようにしてください。

source: Update your code to use the Swift class name instead of the Objective-C name if you gave the Swift class a different name.
ja: あなたがスウィフトクラスに異なる名前を与えるならば、Objective-C名でなくてスウィフトクラス名を使用するようにあなたのコードを更新してください。

source: Updates the left hand side with the pointwise wrapping product of two vectors.
ja: ポイント単位ラップの、２つのベクターの積で左手側を更新します。

source: Updates the left hand side with the wrapping difference of the two vectors.
ja: ラップしている、２つのベクターの差で左手側を更新します。

source: Updates the left hand side with the wrapping sum of the two vectors.
ja: ラップしている、２つのベクターの和で左手側を更新します。

source: Use Never as the return type when declaring a closure, function, or method that unconditionally throws an error, traps, or otherwise does not terminate.
ja: 無条件にエラーをスローする、トラップする、またはそうする以外終了しない、クロージャ、関数、またはメソッドを定義するときに、Neverを戻り型として使ってください。

source: Use a macro to denote the availability of an Objective-C API.
ja: aマクロを使って、Objective-C APIの利用可能性を示してください。

source: Use unsafelyUnwrapped only when you are confident that this instance will never be equal to nil and only after you’ve tried using the postfix ! operator.
ja: unsafelyUnwrappedは、あなたがこのインスタンスは決してnilと等しくないことを確信している場合にのみ、そしてあなたが前置!演算子を使うことを試みた後にのみ使ってください。

source: Use NS_TYPED_ENUM for sets of constants that can't logically have values added in a Swift extension, and use NS_TYPED_EXTENSIBLE_ENUM for sets of constants that can be expanded in an extension.
ja: NS_TYPED_ENUMを、論理的にSwift拡張に加えられた値を持つことができない定数のセットに対して使ってください、そしてNS_TYPED_EXTENSIBLE_ENUMを、ある拡張において拡張されることができる定数のセットに対して使ってください。

source: Use NS_TYPED_ENUM and NS_TYPED_EXTENSIBLE_ENUM when grouping related constants of any type, including string constants.
ja: NS_TYPED_ENUMおよびNS_TYPED_EXTENSIBLE_ENUMを、文字列定数を含む、任意の型の関連する定数をグループにする場合に使ってください。

source: Use API names and parameter names along with documentation to determine whether an API is synchronous or asynchronous.
ja: API名とパラメータ名を、加えてAPIが同期的または非同期的かを明らかにする文書とともに使ってください。

source: Use a KeyValuePairs instance when you need an ordered collection of key-value pairs and don’t require the fast key lookup that the Dictionary type provides.
ja: KeyValuePairsインスタンスを使うのは、あなたがキー値ペアの順序付きコレクションを必要とするそしてDictionary型が提供する高速キー検索を要求しない場合です。

source: Use a sequence of rectangles and other types to perform operations on an AppKit graphic context.
ja: 矩形それらと他の型それらからなるあるシーケンスを使って、いくつかの演算をAppKitのグラフィック的な文脈で実行します。

source: Use a type’s alignment when allocating memory using an unsafe pointer.
ja: この型のもつアライメントを使うのは、安全でないポインタを使うメモリアロケートの場合です。

source: Use an Enumeration to Capture State
ja: 列挙を使って状態をキャプチャしてください

source: Use bridged reference types when you need reference semantics or Foundation-specific behavior.
ja: ブリッジされた参照型を、あなたが参照意味論またはFoundation特有の挙動を必要とする場合に使ってください。

source: Use enumerations to capture and track the state of your app.
ja: 列挙を使ってあなたのアプリの状態をキャプチャおよび追跡します。

source: Use native Swift syntax to interoperate with types and functions in C and Objective-C.
ja: 本来のSwift構文を使ってCおよびObjective-Cでの型および関数と相互作用します。

source: Use nullability annotations or mark regions as annotated to control how Objective-C declarations are imported into Swift.
ja: ヌル可能性注釈を使うかまたは領域が注釈されると印することで、どのようにObjective-C宣言がSwiftへとインポートされるかを制御してください。

source: Use selectors and key paths to interact with dynamic Objective-C APIs.
ja: セレクタとキーパスを使って動的Objective-C APIと相互作用してます。

source: Use set-related operations to check for membership and to add or remove members from an instance of your custom option set type.
ja: セット関連演算を使って、帰属を確認したり、あなたのあつらえのオプションセット型のインスタンス由来のメンバの追加や削除を行ってください。

source: Use the @available() keyword to check availability information in a conditional statement in Objective-C:
ja: @available()キーワードを使って、利用可能性情報をObjective-Cの条件文で確認してください：

source: Use the @objc(name) attribute to provide Objective-C names for properties and methods when necessary.
ja: @objc(name)属性をObjective-C名をプロパティとメソッドに必要に応じて用意するために使ってください。

source: Use the API_AVAILABLE macro to add availability information in Objective-C:
ja: API_AVAILABLEマクロを使って、利用可能性情報をObjective-Cにおいて加えてください：

source: Use the CF_SWIFT_NAME macro to group functions that have related behavior.
ja: CF_SWIFT_NAMEを使って、関連する挙動を持つ関数をグループにまとめてください。

source: Use the NS_CLOSED_ENUM macro for a simple group of constants that you can never add new cases to.
ja: NS_CLOSED_ENUMマクロを、あなたが決してそれに新しいケース節を加えることが出来ない、ある単純な定数グループに対して使ってください。

source: Use the NS_ENUM macro for simple groups of constants.
ja: NS_ENUMマクロを、単純な定数のグループに対して使ってください。

source: Use the NS_REFINED_FOR_SWIFT macro to change how an API is imported into Swift.
ja: NS_REFINED_FOR_SWIFTマクロを使って、あるAPIがSwiftへとインポートされる方法を変更してください。

source: Use the NS_SWIFT_NAME macro to customize API names for Swift.
ja: NS_SWIFT_NAMEを使って、API名をSwift用にカスタマイズしてください。

source: Use the NS_SWIFT_UNAVAILABLE macro to prevent an API from being used in Swift.
ja: NS_SWIFT_UNAVAILABLEを使って、あるAPIがSwiftにおいて使われることを妨げてください。

source: Use the advanced(by:) method in generic code to offset a value by a specified distance.
ja: advanced(by:)メソッドを総称体コードにおいて使用して、ある値を指定された隔たりだけオフセットしてください。

source: Use the alignment property for a type when allocating memory using an unsafe pointer.
ja: ある型に対してalignmentプロパティを使うのは、安全でないポインタを使うメモリアロケートの場合です。

source: Use the contains(_:) method to test whether a set contains a specific element.
ja: contains(_:)メソッドを使って、ある集合が特定の要素を含むかどうかテストしてください。

source: Use the flatMap method with a closure that returns an optional value.
ja: flatMapメソッドをオプショナル値を返すクロージャとともに使ってください。

source: Use the intersection(_:) method to create a new set with only the elements common to a set and another set or sequence.
ja: intersection(_:)メソッドを使って、ある集合と別の集合またはシーケンスに共通の要素だけで新しい集合を作成してください。

source: Use the isDisjoint(with:) method to test whether a set has any elements in common with another set.
ja: isDisjoint(with:)メソッドを使って、ある集合が別の集合と共通の何らかの要素を持つかどうかテストしてください。
